{"What special identifier is used in the interactive interpreter to store the result of the last evaluation?": "_", "What is a new-style class?": "A class which inherits from object", "Which of these is NOT a valid encoding in Python 2?": "utf-48", "What does the expression x[::-1] do?": "Reverses the list x", "What is the value of datetime.MINYEAR?": "1", "Which of the following CANNOT be used as a dictionary key?": "List", "Which of these is the dedicated matrix multiplication operator in Python 3.5?": "@", "Which of the following syntax features was removed in Python 3?": "Tuple parameter unpacking", "Which of these is NOT a valid statement?": "define", "Which of these is the built-in function for sorting iterables?": "sorted()", "Which of these new generator delegation expressions was added in Python 3.3?": "yield from", "In Python 2.7+, what does import antigravity do?": "Opens xkcd in web browser", "Which of these is NOT a built-in constant?": "Debug", "Which of these list methods finds the first occurrence of a value?": "index()", "Which of these is NOT a keyword in Python?": "list", "Which of these tokens is NOT a valid delimiter?": "?", "What method can be useful for accessing inherited methods that have been overridden in a class?": "super()", "What does the cmp() built-in function do?": "Compare objects", "What is printed when you type import this on the shell?": "The Zen of Python", "In Python 2, what is the difference between range and xrange?": "xrange evaluates lazily", "What built-in function takes an integer and returns the corresponding ASCII character?": "chr()", "Which of these is the reference implementation of Python?": "CPython", "An object capable of returning its members one at a time is known as what?": "Iterable", "Which of the following operators in Python 2 is not supported in Python 3?": "<>", "Which of these modules can be used to convert a Python object hierarchy into a byte stream?": "pickle", "What does the expression 2 * [0, 1] evaluate to?": "[0, 1, 0, 1]", "What generator method is used to resume at the last executed yield expression?": "next()", "An expression that returns an iterator is known as what?": "Generator expression", "What does the expression False * False evaluate to?": "0", "What does PEP stand for?": "Python Enhancement Proposal", "What is the output of print [0, 1, 2, 3, 4][10:]": "[]", "What does GIL stand for?": "Global Interpreter Lock", "Which of the following is NOT a built-in exception in Python?": "OutOfMemoryError", "Which of these methods is used to remove an element from a list?": "remove()", "What built-in function can be used for iterating over list index and value pairs?": "enumerate()", "Which of these declarations is used for saving memory in objects?": "__slots__", "What is the name of the major academic conference on Python?": "PyCon", "What does the function def f(arg): pass return?": "None", "Which of these is used for single line comments?": "#", "Which of these is a package manager for Python?": "pip", "What does Python use to denote scopes?": "Whitespace", "Which of the following statements in Python 2 is now a function in Python 3?": "print", "What does round(123.45, -2) return?": "100.0", "The Counter class is available in which module?": "collections", "Using which of these expressions in a function definition makes it a generator function?": "yield", "Which of the following built-in module provides an implementation of the priority queue algorithm?": "heapq", "Guido van Rossum, the creator of Python, is referred to as what in the Python community?": "Benevolent Dictator for Life", "Given a list x = [0, 1, 2], what does func(*x) do?": "Calls func(0, 1, 2)", "Who wrote the poem \"The Zen of Python\"?": "Tim Peters", "pow(x, y) returns x^y. What does pow(x, y, z) return?": "x^y modulo z", "What is the correct syntax for raising exceptions in Python 3?": "raise Exception(args)", "What are objects that can change their value but keep their id() called?": "Mutable", "Which of these functions was moved from the global namespace to the functools module in Python 3?": "reduce()", "What is the process of creating lists from other lists and structures commonly known as?": "List comprehension", "What do you use to get the length of a string in Python?": "len(s)", "In Python 3.5, a coroutine function can be defined using what?": "async def", "Which of these is NOT a built-in module?": "PythonHTTPServer", "Which of these is an invalid literal in Python?": "0b314", "What does the expression 'a' and 'b' evaluate to?": "'b'", "What is the common name for a function returning another function, usually using the @wrapper syntax?": "Decorator", "When was Python 3.0 released?": "2008", "When are a function's default arguments evaluated?": "Once when the function is defined", "What is Python named after?": "Monty Python", "What is the // operator used for?": "Floor division", "What does any([-1, 0, 1]) return?": "True", "What does the raise statement with no arguments do?": "Re-raises the last active exception in the current scope", "Which of these statement constructs is invalid?": "in ... else", "How do you make a class method private?": "Prefix its name with __", "A function that returns a value used for sorting or ordering is known as what?": "Key function", "Which of these exceptions is raised while referencing an unbound variable?": "NameError", "What kind of typing does Python use?": "Duck typing", "Which of these built-in exceptions is raised when the second argument of a division operation is zero?": "ZeroDivisionError", "Which of these is a new keyword in Python 3?": "nonlocal", "What are methods whose names start and end with double underscores called?": "Special methods", "Entering from __future__ import braces on the shell prints what message?": "SyntaxError: not a chance", "Which of these is a built-in lightweight database included in Python's standard library?": "SQLite", "What is the maximum length of variable names in Python?": "Unlimited", "Which of these is a popular scientific computing package for Python?": "NumPy", "Which of these can be used to declare a static method?": "@staticmethod", "Which of these file object methods returns the current position in the open file?": "tell()", "How do you swap two variables, a and b?": "a,b = b,a", "Which of the following best describes the philosophy behind Python's large standard library?": "Batteries included", "What function in the random module can be used to return a random element from a sequence?": "choice()", "Given x = [({})], what does x[0] evaluate to?": "{}", "Which of the following built-in exceptions was removed in Python 3?": "StandardError", "What does EAFP stand for?": "Easier to ask for fogiveness than permission", "Given a = set([1, 2]) and b = set([3, 4]), what does a|b evaluate to?": "set([1, 2, 3, 4])", "What does the expression 0 < 1 < 2 < 3 evaluate to?": "True", "What module provides regular expression matching operations?": "re", "What does the expession 0**-1 evaluate to?": "Raises ZeroDivisionError"}